"""
C. Красивая команда
========================================================================================
ограничение по времени на тест1 секунда
ограничение по памяти на тест256 мегабайт
вводстандартный ввод
выводстандартный вывод
========================================================================================

Завтра у хоккейной команды, которой руководит Евгений, важный матч.
Евгению нужно выбрать шесть игроков, которые выйдут на лед в стартовом составе:
один вратарь, два защитника и три нападающих.

Так как это стартовый состав, Евгения больше волнует, насколько красива будет команда на льду, чем способности игроков.
А именно, Евгений хочет выбрать такой стартовый состав, чтобы номера любых двух игроков из стартового состава
отличались не более, чем в два раза. Например, игроки с номерами 13, 14, 10, 18, 15 и 20 устроят Евгения,
а если, например, на лед выйдут игроки с номерами 8 и 17, то это не устроит Евгения.

Про каждого из игроков вам известно, на какой позиции он играет (вратарь, защитник или нападающий), а также его номер.
В хоккее номера игроков не обязательно идут подряд. Посчитайте число различных стартовых составов из одного вратаря,
двух защитников и трех нападающих, которые может выбрать Евгений, чтобы выполнялось его условие красоты.

========================================================================================
Входные данные
========================================================================================
Первая строка содержит три целых числа g, d и f (1 ≤ g ≤ 1 000, 1 ≤ d ≤ 1 000, 1 ≤ f ≤ 1 000) — число вратарей,
защитников и нападающих в команде Евгения.

Вторая строка содержит g целых чисел, каждое в пределах от 1 до 100 000 — номера вратарей.
Третья строка содержит d целых чисел, каждое в пределах от 1 до 100 000 — номера защитников.
Четвертая строка содержит f целых чисел, каждое в пределах от 1 до 100 000 — номера нападающих.

Гарантируется, что общее количество игроков не превосходит 1 000, т. е. g + d + f ≤ 1 000.
Все g + d + f номеров игроков различны.

========================================================================================
Выходные данные
========================================================================================
Выведите одно целое число — количество возможных стартовых составов.
"""
from itertools import combinations


class Player:
    def __init__(self, t, number):
        self.type = t
        self.number = number

    def __lt__(self, other):
        return self.number < other.number

    def __repr__(self):
        return self.type + ' ' + str(self.number)


def read_line_of_numbers():
    return map(int, input().split())


def read_players(t):
    return map(lambda x: Player(t=t, number=x), sorted(read_line_of_numbers()))


def solution():
    g, d, f = read_line_of_numbers()

    if sum((g, d, f)) < 6:
        print(0)
        return

    goalkeepers = read_players('goalkeeper')
    defenders = read_players('defender')
    forwards = read_players('forward')
    players = sorted((*goalkeepers, *defenders, *forwards))

    def update_players(k, p):
        global gk, df, fw
        if p.type == 'goalkeeper':
            gk += k
        elif p.type == 'defender':
            df += k
        elif p.type == 'forward':
            fw += k

    l = 0
    counter = 0
    while l < len(players) - 6:
        r = l + 6
        gk, df, fw = 0, 0, 0
        for p in players[l:r]:
            update_players(+1, p)
        while r < len(players) and players[r].number < players[l].number * 2 and gk < 1 or df < 2 or fw < 3:
            r += 1
            update_players(+1, players[r])
        if l < len(players) - 6 and gk < 1 or df < 2 or fw < 3:
            update_players(-1, players[l])
            l += 1

    print(counter)


if __name__ == '__main__':
    solution()


"""
Пример 1:
========================================================================================
1 2 3
15
10 19
20 11 13
========================================================================================
1

Пример 2:
========================================================================================
2 3 4
16 40
20 12 19
13 21 11 10
========================================================================================
6
"""